// 1. ფუნქცია, რომელიც გადასცემს წუთებს და აბრუნებს შესაბამის წამების რაოდენობას
function minutesToSeconds(minutes) {
    // ეს ფუნქცია აბრუნებს წამების რაოდენობას
    return minutes * 60; // 1 წუთი = 60 წამი
}

// 2. ფუნქცია, რომელიც გადასცემს სამი რიცხვი და აბრუნებს პირველი ორი რიცხვის ჯამის ნამრავლს მესამე რიცხვზე
function sumAndMultiply(a, b, c) {
    // ეს ფუნქცია აბრუნებს ჯამისა და ნამრავლისთვის
    return (a + b) * c; // (a + b) * c
}

// 3. ფუნქცია, რომელიც გადასცემს ორი რიცხვი და აბრუნებს True-ს თუ პირველი მეტია, ხოლო მეორეზე False (if statement-ის გარეშე)
function isFirstGreaterThanSecond(x, y) {
    // ეს ფუნქცია აბრუნებს Boolean მნიშვნელობას
    return x > y; // პირდაპირ აბრუნებს შედარების შედეგს
}

// 4. ფუნქცია, რომელიც კონსოლში გამოაქვს ( "Element: "  და გადაცემული ელემენტი )
function logElement(element) {
    // ეს ფუნქცია არის void (არ აბრუნებს მნიშვნელობას)
    console.log("Element: " + element); // კონსოლში ასახავს ელემენტს
}

// 5. ფუნქცია, რომელიც გადაცემული id-ელემენტის და სტრინგის მიხედვით ელემენტში ჩასვამს სტრინგს
function setElementTextById(id, text){ 
    // ეს ფუნქცია არის void (არ აბრუნებს მნიშვნელობას)
    const element = document.getElementById(id); // ID-ელემენტის მოძიება
    if (element) 
        element.textContent = text; // ტექსტის ჩასმა ელემენტში
    }